chalupec/nRF9160_Examples/mqtt_working/src/main.c
					crc_err_counter++;
					k_sleep(K_MSEC(10));

					if (crc_err_counter > 30)
					{
						k_sleep(K_MSEC(25));
					}

					if (crc_err_counter > 60)
					{
						k_sleep(K_MSEC(55));
					}

					if (crc_err_counter > 80)
					{
						k_sleep(K_MSEC(50));
					}
					if (crc_err_counter > 100)
					{
						crc_err_counter = 0;
						flash_sample_fail_counter++;
						seed_packet.chan_0_vlt[samples_to_load_cntr] = -32760;
						seed_packet.chan_0_int[samples_to_load_cntr] = -32760;
						seed_packet.chan_1_vlt[samples_to_load_cntr] = -32760;
						seed_packet.chan_1_int[samples_to_load_cntr] = -32760;
						LOG_ERR("CRC mismatch at sample, %d", samples_to_load_cntr); // DEBUG FIX
						// k_sleep(K_MSEC(3));
						samples_to_load_cntr++; // try another sample
						flash_address_read += 10;
					}
				}
			}
		}

		uint16_t sizestruct = sizeof(seed_packet);
		// LOG_INF("size of struct is: %d", sizestruct);
		uint8_t *byte_ptr = (uint8_t *)&seed_packet;

		err = 0;
		//	err = data_publish(&client, MQTT_QOS_1_AT_LEAST_ONCE,
		//						   byte_ptr, sizestruct);
		err = data_publish(&client, MQTT_QOS_0_AT_MOST_ONCE,
						   byte_ptr, sizestruct);
		if (err)
		{
			LOG_INF("Failed to send message, %d", err);
			return;
		}
		seed_packet.CRC = flash_sample_fail_counter; // jen info o poctu falu pri cteni
		LOG_INF("sample record CRC mismatch counter, %d", flash_sample_fail_counter);
	}

	train_counter++;
}

void send_measured_train_data_with_multiple_packets_from_flash_to_UART(void)
{

	k_sleep(K_MSEC(4000));
	uint16_t pckt_cnt = 1;
	uint16_t total_packet_to_send = 0;
	uint16_t samples_to_load_cntr = 0;
	uint16_t fl_buff_bcnt = 0;

	total_packet_to_send = total_recorded_samples / WAVE_SAMPLE_LEN;
	if (circ_buff_overflow == 1)
	{
		total_packet_to_send++;
	}

	flash_address_read = 0;
	while (pckt_cnt <= total_packet_to_send)
	{
		seed_packet.packet_header = 0xBEEF;
		seed_packet.packet_version = 0x0101;
		seed_packet.actual_packet_nr = pckt_cnt++;
		seed_packet.total_packet_nr = total_packet_to_send;
		seed_packet.timestamp = record_unix_time_s;
		seed_packet.train_counter = train_counter;
		seed_packet.CRC = 0xABCD;

		if (circ_buff_overflow == 1)
		{ // circ_buff_overflow occured then use buffered data, than use psram data
			circ_buff_overflow = 0;

			uint16_t temp_head;
			uint16_t temp_tail;

			temp_head = last_circ_buff_record;
			temp_tail = CRCLR_BUFF_SIZE - last_circ_buff_record;

			if (temp_tail == 0)
			{
				memcpy(seed_packet.chan_0_vlt, circ_buff_ch0, CRCLR_BUFF_SIZE * 2);
				memcpy(seed_packet.chan_0_int, circ_buff_ch1, CRCLR_BUFF_SIZE * 2);
				memcpy(seed_packet.chan_1_vlt, circ_buff_ch2, CRCLR_BUFF_SIZE * 2);
				memcpy(seed_packet.chan_1_int, circ_buff_ch3, CRCLR_BUFF_SIZE * 2);
			}
			else
			{
				memcpy(seed_packet.chan_0_vlt, &circ_buff_ch0[temp_head], temp_tail * 2);
				memcpy(seed_packet.chan_0_int, &circ_buff_ch1[temp_head], temp_tail * 2);
				memcpy(seed_packet.chan_1_vlt, &circ_buff_ch2[temp_head], temp_tail * 2);
				memcpy(seed_packet.chan_1_int, &circ_buff_ch3[temp_head], temp_tail * 2);

				memcpy(&seed_packet.chan_0_vlt[temp_tail], circ_buff_ch0, temp_head * 2);
				memcpy(&seed_packet.chan_0_int[temp_tail], circ_buff_ch1, temp_head * 2);
				memcpy(&seed_packet.chan_1_vlt[temp_tail], circ_buff_ch2, temp_head * 2);
				memcpy(&seed_packet.chan_1_int[temp_tail], circ_buff_ch3, temp_head * 2);
			}
		}
		else
		{
			samples_to_load_cntr = 0;
			while (samples_to_load_cntr < WAVE_SAMPLE_LEN)
			{

				fl_buff_bcnt = 0;
				FLASH_MEMORY_READ_DATA(flash_address_read, flash_read_buffer_byte, FLASH_BYTE_READ_OUT_LEN);
				// k_sleep(K_MSEC(1));
				flash_address_read += FLASH_BYTE_READ_OUT_LEN;
				fl_buff_bcnt = 0;
				while (fl_buff_bcnt < FLASH_BYTE_READ_OUT_LEN)
				{
					seed_packet.chan_0_vlt[samples_to_load_cntr] = flash_read_buffer_byte[fl_buff_bcnt++] << 8;
					seed_packet.chan_0_vlt[samples_to_load_cntr] |= flash_read_buffer_byte[fl_buff_bcnt++];
					seed_packet.chan_0_int[samples_to_load_cntr] = flash_read_buffer_byte[fl_buff_bcnt++] << 8;
					seed_packet.chan_0_int[samples_to_load_cntr] |= flash_read_buffer_byte[fl_buff_bcnt++];
					seed_packet.chan_1_vlt[samples_to_load_cntr] = flash_read_buffer_byte[fl_buff_bcnt++] << 8;
					seed_packet.chan_1_vlt[samples_to_load_cntr] |= flash_read_buffer_byte[fl_buff_bcnt++];
					seed_packet.chan_1_int[samples_to_load_cntr] = flash_read_buffer_byte[fl_buff_bcnt++] << 8;
					seed_packet.chan_1_int[samples_to_load_cntr] |= flash_read_buffer_byte[fl_buff_bcnt++];
					samples_to_load_cntr++;
				}
			}
		}

		samples_to_load_cntr = 0;
		while (samples_to_load_cntr < WAVE_SAMPLE_LEN)
		{

			printk("%d,%d,%d,%d\n",
				   seed_packet.chan_0_vlt[samples_to_load_cntr],
				   seed_packet.chan_0_int[samples_to_load_cntr],
				   seed_packet.chan_1_vlt[samples_to_load_cntr],
				   seed_packet.chan_1_int[samples_to_load_cntr]);

			samples_to_load_cntr++;

			k_sleep(K_MSEC(1));
		}
	}
	train_counter++;
}

static void button_handler(uint32_t button_state, uint32_t has_changed)
{
	switch (has_changed)
	{
	case DK_BTN1_MSK:

		if (button_state & DK_BTN1_MSK)
		{
			seed_packet.packet_header = 0xBEEF;
			seed_packet.packet_version = 0x0101;
			seed_packet.actual_packet_nr = 0x0001;
			seed_packet.total_packet_nr = 0x0001;

			seed_packet.timestamp = 1748277406;
			seed_packet.train_counter = train_counter;
			train_counter++;
			seed_packet.CRC = 0xABCD;

			/*memcpy(seed_packet.chan_0_vlt, chan_dat, 64);
			memcpy(seed_packet.chan_1_vlt, chan_dat, 16);
			memcpy(&seed_packet.chan_0_int[5], chan_dat_128, 128);
			memcpy(seed_packet.chan_1_int, &chan_dat_128[10], 50);
*/
			uint16_t sizestruct = sizeof(seed_packet);
			LOG_INF("size of struct is: %d", sizestruct);
			uint8_t *byte_ptr = (uint8_t *)&seed_packet;

			k_sleep(K_MSEC(100));
			LOG_INF("step: %d", 4);
			k_sleep(K_MSEC(100));
			err = data_publish(&client, MQTT_QOS_1_AT_LEAST_ONCE,
							   byte_ptr, sizestruct);
			if (err)
			{
				LOG_INF("Failed to send message, %d", err);
				return;
			}
		}
		break;

