chalupec/nRF9160_Examples/mqtt_working/src/main.c
	case DK_BTN2_MSK:
		if (button_state & DK_BTN2_MSK)
		{
			send_multiple_packets(5);
		}
		break;

	default:
		break;
	}
}

void add_samples_to_buffer(int16_t samples[BUFFER_WIDTH], int16_t buffer[BUFFER_LENGTH][BUFFER_WIDTH])
{
	for (int i = 0; i < BUFFER_WIDTH; i++)
	{
		buffer[index][i] = samples[i];
	}
	index++;
	if (index == BUFFER_LENGTH)
	{
		index = 0;
	}
}

void print_4buffer(int16_t buffer[BUFFER_LENGTH][BUFFER_WIDTH])
{
	for (int i = 0; i < BUFFER_LENGTH; i++)
	{
		for (int j = 0; j < BUFFER_WIDTH; j++)
		{
			printf("%d,", buffer[i][j]);
		}
		printf("\n");
	}
}

void average_of_vectors(int16_t array[BUFFER_LENGTH][BUFFER_WIDTH], int16_t averages[BUFFER_WIDTH])
{
	for (int i = 0; i < BUFFER_WIDTH; i++)
	{
		int32_t total_sum = 0;
		for (int j = 0; j < BUFFER_LENGTH; j++)
		{
			total_sum += array[j][i];
		}
		averages[i] = (int16_t)(total_sum / BUFFER_LENGTH);
	}
}

int32_t exponential_filter(int32_t previous_filtered, int32_t new_sample)
{
	return (ALPHA_NUM * new_sample + (ALPHA_DEN - ALPHA_NUM) * previous_filtered) / ALPHA_DEN;
}

int32_t update_rms(int32_t *buffer, size_t *indexx, int64_t *sum_squares, int32_t new_sample)
{
	// Remove the oldest sample's square from the sum
	int32_t old_sample = buffer[*indexx];
	*sum_squares -= (int64_t)old_sample * old_sample;

	// Add the new sample's square to the sum
	buffer[*indexx] = new_sample;
	*sum_squares += (int64_t)new_sample * new_sample;

	// Update index
	*indexx = (*indexx + 1) % RMS_BUFFER_SIZE;

	// Calculate RMS
	int32_t mean_square = *sum_squares / RMS_BUFFER_SIZE;
	return (int32_t)sqrt((double)mean_square);
}

void circular_buffer_init(void)
{
	buff_head = 0;
	circ_buff_overflow = 1;
	clear_buffer(circ_buff_ch0, CRCLR_BUFF_SIZE);
	clear_buffer(circ_buff_ch1, CRCLR_BUFF_SIZE);
	clear_buffer(circ_buff_ch2, CRCLR_BUFF_SIZE);
	clear_buffer(circ_buff_ch3, CRCLR_BUFF_SIZE);
}

uint16_t circular_buffer_add_value(int16_t value0, int16_t value1, int16_t value2, int16_t value3)
{
	if (buff_head < CRCLR_BUFF_SIZE)
	{
		circ_buff_ch0[buff_head] = value0;
		circ_buff_ch1[buff_head] = value1;
		circ_buff_ch2[buff_head] = value2;
		circ_buff_ch3[buff_head] = value3;
		buff_head++;
	}
	else
	{
		buff_head = 0;
		circ_buff_overflow = 1;
		circ_buff_ch0[buff_head] = value0;
		circ_buff_ch1[buff_head] = value1;
		circ_buff_ch2[buff_head] = value2;
		circ_buff_ch3[buff_head] = value3;
		buff_head++;
	}
	return (buff_head);
}

void get_time_procedure(void)
{
	err = date_time_update_async(NULL);
	if (err)
	{
		LOG_ERR("date_time_update_async error: %d", err);
	}

	struct tm timeinfo;
	int64_t unix_time_ms;

	if (date_time_now(&unix_time_ms))
	{
		LOG_ERR("Failed to get time");
		return;
	}

	time_t unix_time_s = unix_time_ms / 1000;

	record_unix_time_s = unix_time_ms / 1000;

	gmtime_r(&unix_time_s, &timeinfo);

	LOG_INF("Current UTC time: %s", asctime(&timeinfo));
}

uint8_t init_modem_and_mqtt(void)
{
	LOG_INF("Configuring modem");
	err = modem_configure();
	if (err)
	{
		LOG_ERR("Failed to configure the modem");
		return 0;
	}

	if (dk_buttons_init(button_handler) != 0)
	{
		LOG_ERR("Failed to initialize the buttons library");
	}

	LOG_INF("MQTT client init");
	client.keepalive = 30; // FIXME CHECK ONLY
	err = client_init(&client);
	if (err)
	{
		LOG_ERR("Failed to initialize MQTT client: %d", err);
		return 0;
	}

do_connect:
	if (connect_attempt++ > 0)
	{
		LOG_INF("Reconnecting in %d seconds...",
				CONFIG_MQTT_RECONNECT_DELAY_S);
		k_sleep(K_SECONDS(CONFIG_MQTT_RECONNECT_DELAY_S));
	}

	err = mqtt_connect(&client);
	if (err)
	{
		LOG_ERR("Error in mqtt_connect: %d", err);
		goto do_connect;
	}

	err = fds_init(&client, &fds);
	if (err)
	{
		LOG_ERR("Error in fds_init: %d", err);
		return 0;
	}

	return 1;
}

// FIME tady byl konec reseni pooling
int8_t mqtt_pooling_procedure(void)
{
	LOG_INF("mqtt_pooling_procedure - enterning pool wait");
	err = poll(&fds, 1, mqtt_keepalive_time_left(&client));
	if (err < 0)
	{
		LOG_ERR("Error in poll(): %d", errno);
		return (-1);
	}
	err = mqtt_live(&client);
	if ((err != 0) && (err != -EAGAIN))
	{
		LOG_ERR("Error in mqtt_live: %d", err);
		return (-1);
	}
	if ((fds.revents & POLLIN) == POLLIN)
	{
		err = mqtt_input(&client);
		if (err != 0)
		{
			LOG_ERR("Error in mqtt_input: %d", err);
			return (-1);
		}
	}

	if ((fds.revents & POLLERR) == POLLERR)
	{
		LOG_ERR("POLLERR");
		return (-1);
	}

	if ((fds.revents & POLLNVAL) == POLLNVAL)
	{
		LOG_ERR("POLLNVAL");
		return (-1);
	}

	if (dump_log_flag == 1)
	{
		dump_log_flag = 0;
		LOG_INF("ENTERING LOG DUMP MQTT REPORT");

		while ((len = log_ram_read(buf, sizeof(buf))) > 0)
		{

			err = sys_log_data_publish(&client, MQTT_QOS_0_AT_MOST_ONCE, buf, LOG_MANIPULATION_BUFF_LEN); // FIXME CHECK ONLY 10 is ok

			k_sleep(K_MSEC(100));
		}
	}

	if (mqtt_trigger_reset == 1)
	{
		mqtt_trigger_reset = 0;
		LOG_INF("trigger reset in progress");
		k_sleep(K_MSEC(1000));
		LOG_INF("end-up mqtt client connection");

		int8_t errrno;
		errrno = mqtt_disconnect(&client);
		if (errrno)
		{
			LOG_ERR("Could not disconnect: %d", errrno);
		}
		k_sleep(K_MSEC(1000));

		LOG_INF("LTE_LC_FUNC_MODE_OFFLINE");
		lte_lc_func_mode_set(LTE_LC_FUNC_MODE_OFFLINE);
		k_sleep(K_MSEC(1000));
		LOG_INF("nrf_modem_lib_shutdown");
		nrf_modem_lib_shutdown();
		k_sleep(K_MSEC(3000));
		LOG_INF("RST trigg REBOOT NOW");
		k_sleep(K_MSEC(3000));
		sys_reboot(SYS_REBOOT_COLD);
		k_sleep(K_MSEC(1000));
	}

	if (mqtt_skip_init_procedure == 1)
	{
		mqtt_skip_init_procedure = 0;
		LOG_INF("SKIP REQUEST RECEIVED");
		int8_t errrno;
		errrno = mqtt_disconnect(&client);
		if (errrno)
		{
			LOG_ERR("Could not disconnect: %d", errrno);
		}
		k_sleep(K_MSEC(1000));

		LOG_INF("LTE_LC_FUNC_MODE_OFFLINE");
		lte_lc_func_mode_set(LTE_LC_FUNC_MODE_OFFLINE);
		k_sleep(K_MSEC(1000));
		LOG_INF("nrf_modem_lib_shutdown");
		nrf_modem_lib_shutdown();
		k_sleep(K_MSEC(2000));
		return (-1);
	}

	if (first_alive_flag == 2)
	{

		LOG_INF("entering first_alive_flag=2");
		initial_stage_timeout_counter++;
		if (initial_stage_timeout_counter == 2)
		{
			int8_t errrno;
			errrno = mqtt_disconnect(&client);
			if (errrno)
			{
				LOG_ERR("Could not disconnect: %d", errrno);
			}
			k_sleep(K_MSEC(1000));

